In [1]:
import pandas as pd
import sqlite3

In [2]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)

In [3]:
con = sqlite3.Connection("./switrs.sqlite")

### How many collisions are there in the dataset?

In [4]:
QUERY1 = """
SELECT COUNT(1) AS collision_count
FROM collisions
"""

In [5]:
pd.read_sql(QUERY1, con).head()

   collision_count
0          9172565

### What percent of collisions involve males aged 16-25?

In [6]:
QUERY2 = """
SELECT 
    COUNT(DISTINCT case_id) 
    / (SELECT CAST(COUNT(DISTINCT case_id) AS FLOAT) FROM parties)
    AS percentage
FROM parties
WHERE party_sex = 'male'
AND party_age BETWEEN 16 AND 25
"""

In [7]:
pd.read_sql(QUERY2, con)

   percentage
0    0.241562

### How many solo motorcycle crashes are there per year?

In [8]:
QUERY3 = """
SELECT
  STRFTIME('%Y', collision_date) AS collision_year,
  COUNT(1) AS collision_count
FROM collisions
WHERE motorcycle_collision = True
  AND party_count = 1
GROUP BY collision_year
ORDER BY collision_year
"""

In [9]:
pd.read_sql(QUERY3, con)

   collision_year  collision_count
0            2001             3258
1            2002             3393
2            2003             3822
3            2004             3955
4            2005             3755
5            2006             3967
6            2007             4513
7            2008             4948
8            2009             4266
9            2010             3902
10           2011             4054
11           2012             4143
12           2013             4209
13           2014             4267
14           2015             4415
15           2016             4471
16           2017             4373
17           2018             4240
18           2019             3772
19           2020             2984

### What make of vehicle has the largest fraction of accidents on the weekend? During the work week?

Only consider vehciles with at least 10,000 collisions or more.

In [10]:
QUERY4 = """
WITH counter AS (
  SELECT
    p.vehicle_make AS make, 
    SUM(
      CASE WHEN STRFTIME('%w', c.collision_date) IN ('0', '6') THEN 1 ELSE 0 END
    ) AS weekend_count,
    SUM(
      CASE WHEN STRFTIME('%w', c.collision_date) IN ('0', '6') THEN 0 ELSE 1 END
    ) AS weekday_count,
    count(1) AS total
  FROM collisions AS c
  LEFT JOIN parties AS p
    ON c.case_id = p.case_id
  GROUP BY make
  HAVING total >= 10000
)

SELECT * FROM (
  SELECT 
    *,
    weekend_count / CAST(total AS FLOAT) AS weekend_fraction,
    weekday_count / CAST(total AS FLOAT) AS weekday_fraction
  FROM counter
  ORDER BY weekend_fraction DESC
  LIMIT 1
)

UNION

SELECT * FROM (
  SELECT 
    *,
    weekend_count / CAST(total AS FLOAT) AS weekend_fraction,
    weekday_count / CAST(total AS FLOAT) AS weekday_fraction
  FROM counter
  ORDER BY weekday_fraction DESC
  LIMIT 1
)
"""

In [11]:
pd.read_sql(QUERY4, con).head()

,make,weekend_count,weekday_count,total,weekend_fraction,weekday_fraction
0,HARLEY-DAVIDSON,19125,30477,49602,0.385569,0.614431
1,PETERBILT,6477,64102,70579,0.091770,0.908230

### How many different values represent "Toyota" in the Parties database? How would you go about correcting for this?

In [12]:
QUERY5 = """
SELECT 
  vehicle_make,
  COUNT(1) AS number_seen
FROM parties
WHERE LOWER(vehicle_make) = 'toyota'
  OR LOWER(vehicle_make) LIKE 'toy%'
  OR LOWER(vehicle_make) LIKE 'ty%'
GROUP BY vehicle_make
ORDER BY number_seen DESC 
"""

In [13]:
pd.read_sql(QUERY5, con).head(100)

   vehicle_make  number_seen
0        TOYOTA      2374621
1          TOYO       166209
2          TOYT       146746
3         TOYOT         2823
4           TOY         2262
5         TOYTA          246
6       TOYOTA/          181
7         TOYTO           84
8        TOYTOA           71
9        TOYOYA           66
10        TOYT.           65
11         TOYA           51
12      TOYTOTA           45
13        TOYOA           43
14       TOYO /           39
15       TOYT /           17
16        TOYT/           14
17        TYMCO           13
18       TOYOTO           10
19         TOY0           10
20      TOYOYTA            7
21        TOYTT            6
22        TOYOY            6
23       TOYOTS            5
24        TYOTA            4
25         TYOT            4
26     TOYT/SCI            4
27         TOYR            4
28         TOYP            4
29      TOYOTOA            4
30         TOYI            4
31       TOYATA            4
32         TOYY            3
33      TOYOTRA            3
34      TOYOTA`            3
35       TOYORA            3
36       TOYOAT            3
37        TOYAT            3
38     TOY/SCIO            3
39        TOYO`            2
40        TOYOR            2
41      TOYOPET            2
42        TOYO/            2
43       TOY0TA            2
44     TOY SCIO            2
45         TYTO            1
46       TYPE 1            1
47         TYOY            1
48          TYO            1
49         TYMC            1
50         TOY`            1
51        TOYYO            1
52       TOYUTA            1
53         TOYU            1
54        TOYT`            1
55       TOYTYA            1
56        TOYTR            1
57      TOYTOYA            1
58        TOYTC            1
59      TOYT/SC            1
60     TOYT/NIS            1
61       TOYRTA            1
62        TOYPT            1
63      TOYOTYA            1
64       TOYOTY            1
65      TOYOTTA            1
66       TOYOTR            1
67      TOYOTAS            1
68      TOYOTAQ            1
69      TOYOTAD            1
70      TOYOT A            1
71        TOYOQ            1
72       TOYODA            1
73      TOYOATA            1
74        TOYO0            1
75     TOYO/SCI            1
76        TOYO.            1
77     TOYO SCI            1
78         TOYN            1
79         TOYL            1
80         TOYJ            1
81      TOYIOTA            1
82         TOYH            1
83         TOYD            1
84        TOY9O            1
85         TOY.            1
86      TOY OTA            1